ContactsApp/app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Sarah Myers"], ["email", "sarah@email.com"], ["phone", "12345667890"], ["created_at", "2015-11-10 21:18:50.230135"], ["updated_at", "2015-11-10 21:18:50.230135"]]

  def update
    if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = $1, "email" = $2, "phone" = $3, "updated_at" = $4 WHERE "contacts"."id" = $5  [["name", "Sarah Myers"], ["email", "sarah@email.com"], ["phone", "12345667890"], ["updated_at", "2015-11-10 21:27:11.514086"], ["id", 1]]